<tutorial>
	<start>start</start>
	<steps>
		<!-- Start -->
		<step>
			<name>start</name>
			<conditions>
				<condition type="WindowVisible">
					<window>Rules</window>
					<next>playerDialog1</next>
				</condition>
			</conditions>
			<text>\u0414\u043E\u0431\u0440\u043E \u043F\u043E\u0436\u0430\u043B\u043E\u0432\u0430\u0442\u044C \u0443 Scorched3D!
\u042D\u0442\u043E \u043A\u0440\u0430\u0442\u043A\u043E\u0435 \u0440\u0443\u043A\u043E\u0432\u043E\u0434\u0441\u0442\u0432\u043E, \u043A\u043E\u0442\u043E\u0440\u043E\u0435 \u043F\u043E\u043C\u043E\u0436\u0435\u0442 \u0432\u0430\u043C \u043E\u0441\u0432\u043E\u0438\u0442\u044C \u0438\u0433\u0440\u0443.

\u0415\u0441\u043B\u0438 \u0438\u0433\u0440\u0430 \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0442 \u043C\u0435\u0434\u043B\u0435\u043D\u043D\u043E \u0432\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u0438\u0437\u043C\u0435\u043D\u0438\u0442\u044C \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0438 \u0433\u0440\u0430\u0444\u0438\u043A\u0438  \u0443 \u043E\u043A\u043D\u0435 "Settings", \u0443 \u043B\u0430\u0443\u043D\u0447\u0435\u0440\u0435 \u0438\u0433\u0440\u044B.
<a href="rulesDialog">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>
		
		<!-- Rules Dialog -->
		<step>
			<name>rulesDialog</name>
			<conditions>
				<condition type="WindowVisible">
					<window>Rules</window>
					<next>playerDialog1</next>
				</condition>
			</conditions>
			<text>\u041D\u0438\u0436\u0435 \u0440\u0430\u0441\u043F\u043E\u043B\u0430\u0433\u0430\u0435\u0442\u0441\u044F \u043E\u043A\u043D\u043E \u043F\u0440\u0430\u0432\u0438\u043B.

\u041F\u0440\u0438 \u0441\u0435\u0442\u0435\u0432\u043E\u0439 \u0438\u0433\u0440\u0435 \u0432 \u044D\u0442\u043E\u043C \u043E\u043A\u043D\u0435 \u043E\u0442\u043E\u0431\u0440\u0430\u0436\u0430\u044E\u0442\u0441\u044F \u0440\u0430\u0437\u043B\u0438\u0447\u043D\u044B\u0435 \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u044F \u043E\u0442 \u0441\u0435\u0440\u0432\u0435\u0440\u0430. \u042D\u0442\u043E \u043E\u043A\u043D\u043E \u0442\u0430\u043A\u0436\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F, \u0447\u0442\u043E\u0431\u044B \u0443\u0437\u043D\u0430\u0442\u044C \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u044B \u0434\u0430\u043D\u043D\u043E\u0439 \u0438\u0433\u0440\u044B.

\u0415\u0441\u043B\u0438 \u0432\u044B \u043F\u0440\u043E\u0447\u0438\u0442\u0430\u043B\u0438 \u044D\u0442\u043E \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0435 \u043D\u0430\u0436\u043C\u0438\u0442\u0435 \u043A\u043D\u043E\u043F\u043A\u0443 <event action="highlight" window="Rules" control="Ok">Ok</event> \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C.</text>
		</step>
		
		<!-- Player Dialog -->
		<step>
			<name>playerDialog1</name>
			<conditions>
				<condition type="WindowVisible">
					<window>Team</window>
					<next>game</next>
				</condition>
			</conditions>
			<text>\u041D\u0438\u0436\u0435 \u0440\u0430\u0441\u043F\u043E\u043B\u0430\u0433\u0430\u0435\u0442\u0441\u044F \u043E\u043A\u043D\u043E \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0438 \u0438\u0433\u0440\u043E\u043A\u0430.
\u0412 \u044D\u0442\u043E\u043C \u043E\u043A\u043D\u0435 \u0432\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u0438\u0437\u043C\u0435\u043D\u0438\u0442\u044C \u0438\u043C\u044F, \u043A\u043E\u043C\u0430\u043D\u0434\u0443 \u0438 \u043C\u043E\u0434\u0435\u043B\u044C \u0442\u0430\u043D\u043A\u0430 \u0438\u0433\u0440\u043E\u043A\u0430, \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u0432\u044B \u0431\u0443\u0434\u0435\u0442\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u0432 \u0438\u0433\u0440\u0435.
<a href="playerDialog2">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>
		<step>
			<name>playerDialog2</name>
			<conditions>
				<condition type="WindowVisible">
					<window>Team</window>
					<next>game</next>
				</condition>
			</conditions>
			<text>\u041F\u043E\u043B\u0435 <event action="highlight" window="Team" control="Name">\u0438\u043C\u044F \u0438\u0433\u0440\u043E\u043A\u0430</event> \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u0432\u0430\u043C \u0438\u0437\u043C\u0435\u043D\u0438\u0442\u044C \u0438\u043C\u044F, \u043A\u043E\u0442\u043E\u0440\u043E\u0435 \u0431\u0443\u0434\u0435\u0442 \u043F\u0440\u0438\u0441\u0432\u043E\u0435\u043D\u043E \u0432\u0430\u0448\u0435\u043C\u0443 \u0442\u0430\u043D\u043A\u0443. \u041F\u043E\u0434 \u044D\u0442\u0438\u043C \u0438\u043C\u0435\u043D\u0435\u043C \u0432\u044B \u0431\u0443\u0434\u0435\u0442\u0435 \u0432\u0438\u0434\u043D\u044B \u0434\u043B\u044F \u0434\u0440\u0443\u0433\u0438\u0445 \u0438\u0433\u0440\u043E\u043A\u043E\u0432.
\u0423\u0434\u0430\u043B\u0438\u0442\u0435 \u0442\u0435\u043A\u0443\u0449\u0435\u0435 \u0438\u043C\u044F \u043D\u0430\u0436\u0430\u0442\u0438\u0435\u043C \u043A\u043D\u043E\u043F\u043A\u0438 "Delete", \u0430 \u0437\u0430\u0442\u0435\u043C \u0432\u0432\u0435\u0434\u0438\u0442\u0435 \u043D\u043E\u0432\u043E\u0435 \u0438\u043C\u044F \u0438\u0433\u0440\u043E\u043A\u0430, \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u044F \u043A\u043B\u0430\u0432\u0438\u0430\u0442\u0443\u0440\u0443.
<a href="playerDialog3">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>
		<step>
			<name>playerDialog3</name>
			<conditions>
				<condition type="WindowVisible">
					<window>Team</window>
					<next>game</next>
				</condition>
			</conditions>
			<text>\u0415\u0441\u043B\u0438 \u0432\u044B \u0441\u043E\u0437\u0434\u0430\u043B\u0438 \u0438\u0433\u0440\u0443, \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u0443\u0447\u0430\u0441\u0442\u0432\u0443\u0435\u0442 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0438\u0433\u0440\u043E\u043A\u043E\u0432, \u0442\u043E \u043C\u043E\u0436\u043D\u043E \u043F\u043E\u043C\u0435\u043D\u044F\u0442\u044C \u0442\u0438\u043F \u044D\u0442\u0438\u0445 \u0438\u0433\u0440\u043E\u043A\u043E\u0432, \u043C\u0435\u0436\u0434\u0443 \u0431\u043E\u0442\u043E\u043C \u0438 \u043D\u0430\u0441\u0442\u043E\u044F\u0449\u0438\u043C \u0438\u0433\u0440\u043E\u043A\u043E\u043C. \u0421\u043C\u0435\u043D\u0438\u0442\u044C \u0442\u0438\u043F \u0438\u0433\u0440\u043E\u043A\u0430 \u043C\u043E\u0436\u043D\u043E \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u043F\u0430\u043D\u0435\u043B\u0438 <event action="highlight" window="Team" control="Type">\u0442\u0438\u043F</event>.
\u0421\u0435\u0439\u0447\u0430\u0441, \u043F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430 \u043D\u0435 \u0438\u0437\u043C\u0435\u043D\u044F\u0439\u0442\u0435 \u0442\u0438\u043F \u0442\u0435\u043A\u0443\u0449\u0435\u0433\u043E \u0438\u0433\u0440\u043E\u043A\u0430, \u0447\u0442\u043E\u0431\u044B \u0432\u044B \u0441\u043C\u043E\u0433\u043B\u0438 \u0438\u0433\u0440\u0430\u0442\u044C.
<a href="playerDialog4">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>
		<step>
			<name>playerDialog4</name>
			<conditions>
				<condition type="WindowVisible">
					<window>Team</window>
					<next>game</next>
				</condition>
			</conditions>
			<text>\u041F\u0430\u043D\u0435\u043B\u044C <event action="highlight" window="Team" control="Color">\u0446\u0432\u0435\u0442</event> \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u0438\u0437\u043C\u0435\u043D\u0438\u0442\u044C \u0446\u0432\u0435\u0442 \u0442\u0435\u043A\u0443\u0449\u0435\u0433\u043E \u0438\u0433\u0440\u043E\u043A\u0430.
\u041F\u0440\u0438 \u043A\u043E\u043C\u0430\u043D\u0434\u043D\u043E\u0439 \u0438\u0433\u0440\u0435 \u0446\u0432\u0435\u0442 \u043E\u0442\u0432\u0435\u0447\u0430\u0435\u0442 \u0437\u0430 \u043A\u043E\u043C\u0430\u043D\u0434\u0443, \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u0432\u044B \u0431\u0443\u0434\u0435\u0442\u0435 \u0438\u0433\u0440\u0430\u0442\u044C (\u043D\u0430\u043F\u0440\u0438\u043C\u0435\u0440 \u0441\u0438\u043D\u0438\u0435 \u0438\u043B\u0438 \u043A\u0440\u0430\u0441\u043D\u044B\u0435).
\u041A\u043E\u043C\u0430\u043D\u0434\u043D\u044B\u0435 \u0438\u0433\u0440\u044B \u0438 \u0438\u0433\u0440\u044B \u0441 \u043E\u0434\u043D\u0438\u043C \u0438\u0433\u0440\u043E\u043A\u043E\u043C \u0438\u043B\u0438 \u0431\u043E\u043B\u0435\u0435 \u043C\u043E\u0433\u0443\u0442 \u0431\u044B\u0442\u044C \u0441\u043E\u0437\u0434\u0430\u043D\u044B \u043F\u0440\u0438 \u0432\u044B\u0431\u043E\u0440\u0435 \u0440\u0435\u0436\u0438\u043C\u0430 "custom game" \u0432 \u0433\u043B\u0430\u0432\u043D\u043E\u043C \u043C\u0435\u043D\u044E \u0438\u0433\u0440\u044B.
<a href="playerDialog5">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>
		<step>
			<name>playerDialog5</name>
			<conditions>
				<condition type="WindowVisible">
					<window>Team</window>
					<next>game</next>
				</condition>
			</conditions>
			<text>\u041F\u0430\u043D\u0435\u043B\u044C \u0432\u044B\u0431\u043E\u0440\u0430 <event action="highlight" window="Team" control="Tank">\u0442\u0430\u043D\u043A\u0430</event> \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u0432\u0430\u043C \u0432\u044B\u0431\u0440\u0430\u0442\u044C \u043C\u043E\u0434\u0435\u043B\u044C \u0432\u0430\u0448\u0435\u0433\u043E \u0442\u0430\u043D\u043A\u0430 \u0432 \u0438\u0433\u0440\u0435.
\u0425\u043E\u0442\u044F \u043A\u0430\u0436\u0434\u044B\u0439 \u0442\u0430\u043D\u043A \u0432\u044B\u0433\u043B\u044F\u0434\u0438\u0442 \u043F\u043E \u0440\u0430\u0437\u043D\u043E\u043C\u0443, \u0432\u0441\u0435 \u043E\u043D\u0438 \u0438\u043C\u0435\u044E\u0442 \u043E\u0434\u0438\u043D\u0430\u043A\u043E\u0432\u044B\u0435 \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0430 \u0438 \u043E\u0440\u0443\u0436\u0438\u0435.
<a href="playerDialog6">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>
		<step>
			<name>playerDialog6</name>
			<conditions>
				<condition type="WindowVisible">
					<window>Team</window>
					<next>game</next>
				</condition>
			</conditions>
			<text>\u041F\u043E\u0441\u043B\u0435 \u0442\u043E\u0433\u043E, \u043A\u0430\u043A \u0432\u044B \u043D\u0430\u0437\u0432\u0430\u043B\u0438 \u0441\u0432\u043E\u0435\u0433\u043E \u0438\u0433\u0440\u043E\u043A\u0430, \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0438\u043B\u0438 \u0435\u0433\u043E \u0446\u0432\u0435\u0442, \u0438 \u043C\u043E\u0434\u0435\u043B\u044C \u0442\u0430\u043D\u043A\u0430 \u043D\u0430\u0436\u043C\u0438\u0442\u0435 \u043A\u043D\u043E\u043F\u043A\u0443  <event action="highlight" window="Team" control="Play">"\u0418\u0433\u0440\u0430\u0442\u044C"</event> \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C.</text>
		</step>		
		
		<!-- Game -->
		<step>
			<name>game</name>
			<conditions>
				<condition type="FirstMove">
					<next>firing</next>
				</condition>
			</conditions>
			<text>\u042D\u0442\u043E \u0430\u0440\u0435\u043D\u0430 \u0432 \u0438\u0433\u0440\u0435 Scorched3D. \u0413\u043B\u0430\u0432\u043D\u0430\u044F \u0446\u0435\u043B\u044C \u0442\u0435\u043A\u0443\u0449\u0435\u0439 \u0438\u0433\u0440\u044B \u0443\u043D\u0438\u0447\u0442\u043E\u0436\u0438\u0442\u044C \u0432\u0441\u0435 <event action="targets">\u0434\u0440\u0443\u0433\u0438\u0435 \u0442\u0430\u043D\u043A\u0438</event> \u043D\u0430 \u0430\u0440\u0435\u043D\u0435. \u041F\u043E\u0441\u043B\u0435\u0434\u043D\u0438\u0439 \u0432\u044B\u0436\u0438\u0432\u0448\u0438\u0439 \u0442\u0430\u043D\u043A, \u0432\u044B\u0438\u0433\u0440\u044B\u0432\u0430\u0435\u0442 \u0440\u0430\u0443\u043D\u0434. \u0418\u0433\u0440\u043E\u043A \u0441 \u043D\u0430\u0438\u0431\u043E\u043B\u044C\u0448\u0438\u043C \u043A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E\u043C \u0432\u044B\u0438\u0433\u0440\u0430\u043D\u043D\u044B\u0445 \u0440\u0430\u0443\u043D\u0434\u043E\u0432 \u0432\u044B\u0438\u0433\u0440\u044B\u0432\u0430\u0435\u0442 \u0438\u0433\u0440\u0443.
<a href="game2">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>
		
		<step>
			<name>game2</name>
			<conditions>
				<condition type="FirstMove">
					<next>firing</next>
				</condition>
			</conditions>
			<text>\u0418\u0433\u0440\u043E\u043A\u0438 \u043F\u043E\u043B\u0443\u0447\u0430\u044E\u0442 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u044C \u0445\u043E\u0434\u0430, \u043E\u0434\u0438\u043D \u0437\u0430 \u0434\u0440\u0443\u0433\u0438\u043C, \u0447\u0442\u043E\u0431\u044B \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u0438\u0442\u044C \u043E\u0431\u043E\u0440\u043E\u043D\u0443 \u0438 \u0432\u044B\u0441\u0442\u0440\u0435\u043B\u0438\u0442\u044C \u0438\u0437 \u0441\u0432\u043E\u0435\u0433\u043E \u043E\u0440\u0443\u0436\u0438\u044F. \u0415\u0441\u0442\u044C \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u044C \u0438\u0437\u043C\u0435\u043D\u0438\u0442\u044C \u0442\u0438\u043F \u0441\u043C\u0435\u043D\u044B \u0445\u043E\u0434\u043E\u0432, \u043D\u0430\u0441\u0442\u0440\u043E\u0438\u0432 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u044B \u043F\u0435\u0440\u0435\u0434 \u0438\u0433\u0440\u043E\u0439.
<a href="game2b">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>
		
		<step>
			<name>game2b</name>
			<conditions>
				<condition type="FirstMove">
					<next>firing</next>
				</condition>
			</conditions>
			<text>\u0427\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u0442\u044C \u0442\u0435\u043A\u0443\u0449\u0438\u0439 \u0441\u0447\u0435\u0442, \u0432\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u0432 \u043B\u044E\u0431\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u043D\u0430\u0436\u0430\u0442\u044C \u043A\u043D\u043E\u043F\u043A\u0443 "S" (\u043F\u043E \u0443\u043C\u043E\u043B\u0447\u0430\u043D\u0438\u044E). \u042D\u0442\u043E \u043E\u043A\u043D\u043E \u0442\u0430\u043A\u0436\u0435 \u043F\u043E\u043C\u043E\u0436\u0435\u0442 \u0432\u0430\u043C \u0443\u0437\u043D\u0430\u0442\u044C \u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0440\u0430\u0443\u043D\u0434\u043E\u0432 \u043E\u0441\u0442\u0430\u043B\u043E\u0441\u044C \u043A \u043E\u043A\u043E\u043D\u0447\u0430\u043D\u0438\u044E \u0442\u0435\u043A\u0443\u0449\u0435\u0439 \u0438\u0433\u0440\u044B.
<a href="game3">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>
		
		<step>
			<name>game3</name>
			<conditions>
				<condition type="FirstMove">
					<next>firing</next>
				</condition>
			</conditions>
			<text>\u042D\u0442\u043E <event action="player">\u0432\u0430\u0448 \u0442\u0430\u043D\u043A</event>.
\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u043A\u043D\u043E\u043F\u043A\u0443 "3" \u043D\u0430 \u043A\u043B\u0430\u0432\u0438\u0430\u0442\u0443\u0440\u0435 \u0447\u0442\u043E\u0431\u044B \u043F\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u0442\u044C \u043D\u0430 \u043D\u0435\u0433\u043E \u0432\u0431\u043B\u0438\u0437\u0438.
\u041A\u043D\u043E\u043F\u043A\u0438 \u043E\u0442 "0" \u0434\u043E "9" \u043D\u0430 \u043A\u043B\u0430\u0432\u0438\u0430\u0442\u0443\u0440\u0435, \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u044E\u0442\u0441\u044F \u0434\u043B\u044F \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u044F \u043F\u043E\u0437\u0438\u0446\u0438\u0438 \u043A\u0430\u043C\u0435\u0440\u044B \u043D\u0430 \u0430\u0440\u0435\u043D\u0435.
<a href="game4">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>
				
		<step>
			<name>game4</name>
			<conditions>
				<condition type="FirstMove">
					<next>firing</next>
				</condition>
			</conditions>
			<text>\u041C\u043E\u0436\u043D\u043E \u0442\u0430\u043A\u0436\u0435 \u0438\u0437\u043C\u0435\u043D\u044F\u0442\u044C \u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u0435 \u043A\u0430\u043C\u0435\u0440\u044B \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u043C\u044B\u0448\u0438.
\u041D\u0430\u0436\u0438\u043C\u0430\u044F (\u0438\u043B\u0438 \u043F\u0435\u0440\u0435\u0442\u0430\u0441\u043A\u0438\u0432\u0430\u044F) \u043B\u0435\u0432\u0443\u044E \u043A\u043D\u043E\u043F\u043A\u0443 \u043C\u044B\u0448\u0438 \u043D\u0430 \u043B\u0430\u043D\u0434\u0448\u0430\u0444\u0442\u0435 \u043A\u0430\u043C\u0435\u0440\u0430 \u0431\u0443\u0434\u0435\u0442 \u043F\u0435\u0440\u0435\u0434\u0432\u0438\u0433\u0430\u0442\u044C\u0441\u044F \u043D\u0430 \u043F\u043E\u0437\u0438\u0446\u0438\u044E, \u043D\u0430 \u043A\u043E\u0442\u043E\u0440\u0443\u044E \u0432\u044B \u0443\u043A\u0430\u0437\u0430\u043B\u0438 \u043C\u044B\u0448\u044C\u044E.
\u041D\u0430\u0436\u0430\u0442\u0438\u0435 (\u0438\u043B\u0438 \u043F\u0435\u0440\u0435\u0442\u0430\u0441\u043A\u0438\u0432\u0430\u043D\u0438\u0435) \u043F\u0440\u0430\u0432\u043E\u0439 \u043A\u043D\u043E\u043F\u043A\u0438 \u043C\u044B\u0448\u0438 \u043F\u043E \u043B\u0430\u043D\u0434\u0448\u0430\u0444\u0442\u0443 \u0431\u0443\u0434\u0435\u0442 \u0432\u0440\u0430\u0449\u0430\u0442\u044C \u043A\u0430\u043C\u0435\u0440\u0443.
\u041A\u043E\u043D\u0442\u0440\u043E\u043B\u044C \u0443\u0432\u0435\u043B\u0438\u0447\u0435\u043D\u0438\u044F \u043C\u0430\u0441\u0448\u0442\u0430\u0431\u0430 \u043E\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u043A\u043E\u043B\u0435\u0441\u0438\u043A\u0430 \u043C\u044B\u0448\u0438.
<a href="game4a">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>
		
		<step>
			<name>game4a</name>
			<conditions>
				<condition type="FirstMove">
					<next>firing</next>
				</condition>
			</conditions>
			<text>\u0422\u0435\u043F\u0435\u0440\u044C \u043F\u0440\u0438\u0448\u043B\u043E \u0432\u0440\u0435\u043C\u044F \u0441\u0434\u0435\u043B\u0430\u0442\u044C \u0445\u043E\u0434.
\u041F\u0435\u0440\u0432\u044B\u043C \u0448\u0430\u0433\u043E\u043C \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0432\u044B\u0431\u0440\u0430\u0442\u044C \u0446\u0435\u043B\u044C, \u0432\u0442\u043E\u0440\u044B\u043C - \u0432\u044B\u0431\u0440\u0430\u0442\u044C \u043E\u0440\u0443\u0436\u0438\u0435, \u0430 \u0442\u0440\u0435\u0442\u044C\u0438\u043C \u0438 \u0444\u0438\u043D\u0430\u043B\u044C\u043D\u044B\u043C - \u043F\u0440\u0438\u0446\u0435\u043B\u0438\u0442\u0441\u044F \u0438 \u0432\u044B\u0441\u0442\u0440\u0435\u043B\u0438\u0442\u044C.
<a href="game4b">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>			
		
		<step>
			<name>game4b</name>
			<conditions>
				<condition type="FirstMove">
					<next>firing</next>
				</condition>
			</conditions>
			<text>\u0415\u0441\u0442\u044C \u043C\u043D\u043E\u0436\u0435\u0441\u0442\u0432\u043E \u043A\u0440\u0438\u0442\u0435\u0440\u0438\u0435\u0432, \u043F\u043E \u043A\u043E\u0442\u043E\u0440\u044B\u043C \u043C\u043E\u0436\u043D\u043E \u0432\u044B\u0431\u0440\u0430\u0442\u044C \u0446\u0435\u043B\u044C. \u041D\u0430\u043F\u0440\u0438\u043C\u0435\u0440,  \u043C\u043E\u0436\u043D\u043E \u0432\u044B\u0431\u0440\u0430\u0442\u044C \u0446\u0435\u043B\u044C \u043F\u043E \u0435\u0451 \u0440\u0430\u0441\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u044E \u043D\u0430 \u043B\u0430\u043D\u0434\u0448\u0430\u0444\u0442\u0435, \u043F\u043E \u0435\u0451 \u0441\u0447\u0435\u0442\u0443 \u0432 \u0438\u0433\u0440\u0435, \u0438\u043B\u0438 \u0434\u0430\u0436\u0435 \u043F\u043E \u0442\u043E\u043C, \u043D\u0430\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0432\u044B \u043D\u0435 \u043B\u044E\u0431\u0438\u0442\u0435 \u044D\u0442\u043E\u0433\u043E \u0438\u0433\u0440\u043E\u043A\u0430!
<a href="game4c">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>	
		
		<step>
			<name>game4c</name>
			<conditions>
				<condition type="FirstMove">
					<next>firing</next>
				</condition>
			</conditions>
			<text>\u041F\u043E\u0441\u043B\u0435 \u0432\u044B\u0431\u043E\u0440\u0430 \u0446\u0435\u043B\u0438 \u0432\u0430\u043C \u043D\u0443\u0436\u043D\u043E \u0432\u044B\u0431\u0440\u0430\u0442\u044C <event action="highlight" window="Weapon" control="Weapon">\u043E\u0440\u0443\u0436\u0438\u0435</event>.  \u042D\u0442\u043E \u043C\u043E\u0436\u043D\u043E \u0441\u0434\u0435\u043B\u0430\u0442\u044C, \u043D\u0430\u0436\u0430\u0432 \u043D\u0430 \u043F\u0430\u043D\u0435\u043B\u044C \u043E\u0440\u0443\u0436\u0438\u044F. \u041D\u0430 \u043D\u0430\u0447\u0430\u043B\u0435 \u0438\u0433\u0440\u044B \u0432\u044B \u0440\u0430\u0441\u043F\u043E\u043B\u0430\u0433\u0430\u0435\u0442\u0435 \u0432\u0441\u0435\u0433\u043E \u043E\u0434\u043D\u0438\u043C \u0442\u0438\u043F\u043E\u043C \u043E\u0440\u0443\u0436\u0438\u044F, \u043D\u043E \u0432\u044B \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u0435 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u044C \u043F\u043E\u043A\u0443\u043F\u0430\u0442\u044C \u0441\u0435\u0431\u0435 \u0440\u0430\u0437\u043D\u043E\u0435 \u043E\u0440\u0443\u0436\u0438\u0435 \u0432 \u0434\u0430\u043B\u044C\u043D\u0435\u0439\u0448\u0438\u0445 \u0440\u0430\u0443\u043D\u0434\u0430\u0445. \u041E\u0440\u0443\u0436\u0438\u0435 \u043F\u043E\u043A\u0443\u043F\u0430\u0435\u0442\u0441\u044F \u0437\u0430 \u0434\u0435\u043D\u044C\u0433\u0438, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0432\u044B \u043F\u043E\u043B\u0443\u0447\u0438\u043B\u0438 \u0432\u043F\u043E\u0441\u043B\u0435\u0434\u0441\u0442\u0432\u0438\u0438 \u0443\u0431\u0438\u0439\u0441\u0442\u0432\u0430 \u0432\u0430\u0448\u0438\u0445 \u0432\u0440\u0430\u0433\u043E\u0432 \u0438\u043B\u0438 \u0432\u044B\u0438\u0433\u0440\u044B\u0448\u0430 \u0440\u0430\u0443\u043D\u0434\u0430.
<a href="game5">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>			
		
		<step>
			<name>game5</name>
			<conditions>
				<condition type="FirstMove">
					<next>firing</next>
				</condition>
			</conditions>
			<text>\u041F\u0440\u0438\u0446\u0435\u043B\u0438\u0432\u0430\u043D\u0438\u0435 \u043F\u0443\u0448\u043A\u0438 \u0442\u0430\u043D\u043A\u0430 \u043E\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u0441\u0442\u0440\u0435\u043B\u043E\u043A (\u043A\u0443\u0440\u0441\u043E\u0440\u0430) \u043D\u0430 \u043A\u043B\u0430\u0432\u0438\u0430\u0442\u0443\u0440\u0435.
\u041A\u043D\u043E\u043F\u043A\u0438 "\u0432\u043B\u0435\u0432\u043E" \u0438 "\u0432\u043F\u0440\u0430\u0432\u043E" \u043E\u0442\u0432\u0435\u0447\u0430\u044E\u0442 \u0437\u0430 \u043F\u043E\u0432\u043E\u0440\u043E\u0442 \u043F\u0443\u0448\u043A\u0438 (\u043F\u043E \u043E\u0441\u0438 "\u0445").
\u041A\u043D\u043E\u043F\u043A\u0438 "\u0432\u0432\u0435\u0440\u0445" \u0438  "\u0432\u043D\u0438\u0437" \u043E\u0442\u0432\u0435\u0447\u0430\u044E\u0442 \u0437\u0430 \u043D\u0430\u043A\u043B\u043E\u043D \u043F\u0443\u0448\u043A\u0438 (\u043F\u043E \u043E\u0441\u0438 "y"). \u0421 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u043A\u043D\u043E\u043F\u043E\u043A "+" \u0438 "-" \u043C\u043E\u0436\u043D\u043E \u0438\u0437\u043C\u0435\u043D\u044F\u0442\u044C \u0441\u0438\u043B\u0443 \u0432\u044B\u0441\u0442\u0440\u0435\u043B\u0430.
<a href="game5a">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>		
		
		<step>
			<name>game5a</name>
			<conditions>
				<condition type="FirstMove">
					<next>firing</next>
				</condition>
			</conditions>
			<text>\u0412\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u0443\u0441\u043A\u043E\u0440\u0438\u0442\u044C \u0442\u043E\u0447\u043D\u043E\u0441\u0442\u044C \u043A\u043E\u0440\u0440\u0435\u043A\u0442\u0438\u0440\u043E\u0432\u043A\u0438 \u0443\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u044F \u043A\u043D\u043E\u043F\u043A\u0443 "Control". \u0427\u0442\u043E\u0431\u044B \u0437\u0430\u043C\u0435\u0434\u043B\u0438\u0442\u044C \u0441\u043A\u043E\u0440\u043E\u0441\u0442\u044C \u043A\u043E\u0440\u0440\u0435\u043A\u0442\u0438\u0440\u043E\u0432\u043A\u0438 \u043D\u0443\u0436\u043D\u043E \u0443\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0442\u044C \u043A\u043D\u043E\u043F\u043A\u0443 "Shift" \u043D\u0430 \u043A\u043B\u0430\u0432\u0438\u0430\u0442\u0443\u0440\u0435.
<a href="game6">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>			
		
		<step>
			<name>game6</name>
			<conditions>
				<condition type="FirstMove">
					<next>firing</next>
				</condition>
			</conditions>
			<text>\u0411\u043E\u043B\u0435\u0435 \u043F\u0440\u043E\u0441\u0442\u044B\u043C \u0441\u043F\u043E\u0441\u043E\u0431\u043E\u043C \u043F\u043E\u0432\u0435\u0440\u043D\u0443\u0442\u044C \u043F\u0443\u0448\u043A\u0443 \u0432 \u043D\u0443\u0436\u043D\u043E\u0435 \u043C\u0435\u0441\u0442\u043E \u044D\u0442\u043E \u043D\u0430\u0436\u0430\u0442\u044C \u043A\u043D\u043E\u043F\u043A\u0443 "A", \u043A\u043E\u0433\u0434\u0430 \u043A\u0443\u0440\u0441\u043E\u0440 \u043C\u044B\u0448\u0438 \u043D\u0430\u0445\u043E\u0434\u0438\u0442\u0441\u044F \u0432 \u0442\u043E\u043C \u043C\u0435\u0441\u0442\u0435, \u043D\u0430 \u043A\u043E\u0442\u043E\u0440\u043E\u0435 \u0432\u044B \u0445\u043E\u0442\u0438\u0442\u0435 \u043D\u0430\u0446\u0435\u043B\u0438\u0442\u044C \u043F\u0443\u0448\u043A\u0443.
\u041D\u043E \u044D\u0442\u0430 \u0444\u0443\u043D\u043A\u0446\u0438\u044F \u043D\u0430\u0441\u0442\u0440\u043E\u0438\u0442 \u0442\u043E\u043B\u044C\u043A\u043E \u043F\u043E\u0432\u043E\u0440\u043E\u0442 \u043F\u0443\u0448\u043A\u0438 (\u043F\u043E \u043E\u0441\u0438 "\u0445"), \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0438 \u0441\u0438\u043B\u044B \u0432\u044B\u0441\u0442\u0440\u0435\u043B\u0430 \u0438 \u043D\u0430\u043A\u043B\u043E\u043D\u0430 \u0432\u044B \u0434\u043E\u043B\u0436\u043D\u044B \u0431\u0443\u0434\u0435\u0442\u0435 \u0437\u0430\u0434\u0430\u0442\u044C \u0432\u0440\u0443\u0447\u043D\u0443\u044E.
<a href="game7">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>		
	
		<step>
			<name>game7</name>
			<conditions>
				<condition type="FirstMove">
					<next>firing</next>
				</condition>
			</conditions>
			<text>\u0412\u043E \u0432\u0440\u0435\u043C\u044F \u043F\u0440\u0438\u0446\u0435\u043B\u0438\u0432\u0430\u043D\u0438\u044F \u0432\u0441\u0435\u0433\u0434\u0430 \u0445\u043E\u0440\u043E\u0448\u0435\u0439 \u0438\u0434\u0435\u0435\u0439 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0443\u0447\u0435\u0441\u0442\u044C <event action="highlight" window="Wind" control="Wind">\u0432\u0435\u0442\u0435\u0440</event>, \u0435\u0441\u043B\u0438 \u043E\u043D \u043F\u0440\u0438\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u0435\u0442.
\u0412\u0435\u0442\u0435\u0440 \u043C\u043E\u0436\u0435\u0442 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0435\u043D\u043D\u043E \u0438\u0437\u043C\u0435\u043D\u0438\u0442\u044C \u0442\u0440\u0430\u0435\u043A\u0442\u043E\u0440\u0438\u044E \u043F\u043E\u043B\u0435\u0442\u0430 \u0441\u043D\u0430\u0440\u044F\u0434\u0430.
<a href="firing">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>			
	
		<step>
			<name>firing</name>
			<conditions>
				<condition type="TankDead">
					<next>checkbuying</next>
				</condition>
			</conditions>
			<text>\u041F\u043E\u0441\u043B\u0435 \u0442\u043E\u0433\u043E, \u043A\u0430\u043A \u0432\u044B \u0437\u0430\u0432\u0435\u0440\u0448\u0438\u043B\u0438 \u043F\u0440\u0438\u0446\u0435\u043B\u0438\u0432\u0430\u043D\u0438\u0435 \u043F\u0440\u0438\u0448\u043B\u043E \u0432\u0440\u0435\u043C\u044F \u0432\u044B\u0441\u0442\u0440\u0435\u043B\u0438\u0442\u044C.
\u041A\u0430\u043A \u043F\u0440\u0430\u0432\u0438\u043B\u043E \u0432\u0441\u0435 \u0438\u0433\u0440\u043E\u043A\u0438 \u043F\u043E\u043B\u0443\u0447\u0430\u044E\u0442 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u044C \u0445\u043E\u0434\u0430, \u043D\u043E \u0432 \u044D\u0442\u043E\u043C \u043A\u0443\u0440\u0441\u0435 \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u044F \u0432\u0440\u0430\u0433\u0438 \u043D\u0435 \u0431\u0443\u0434\u0443\u0442 \u0441\u0442\u0440\u0435\u043B\u044F\u0442\u044C.

\u0427\u0442\u043E\u0431\u044B \u0432\u044B\u0441\u0442\u0440\u0435\u043B\u0438\u0442\u044C, \u043D\u0430\u0436\u043C\u0438\u0442\u0435 \u043A\u043D\u043E\u043F\u043A\u0443 "space" \u043D\u0430 \u043A\u043B\u0430\u0432\u0438\u0430\u0442\u0443\u0440\u0435.

\u0418\u0437\u043C\u0435\u043D\u044F\u0439\u0442\u0435 \u043D\u0430\u0432\u0435\u0434\u0435\u043D\u0438\u0435 \u043F\u0443\u0448\u043A\u0438 \u0438 \u0441\u0442\u0440\u0435\u043B\u044F\u0439\u0442\u0435, \u043F\u043E\u043A\u0430 \u043D\u0435 \u043F\u043E\u0440\u0430\u0437\u0438\u0442\u0435 \u043B\u044E\u0431\u0443\u044E \u0438\u0437 \u043E\u0442\u043C\u0435\u0447\u0435\u043D\u043D\u044B\u0445 \u0446\u0435\u043B\u0435\u0439.</text>
		</step>		

    <step>
      <name>checkbuying</name>
      <conditions>
        <condition type="WindowWait">
          <window>Buy</window>
          <next>buying</next>
        </condition>
      </conditions>
      <text>\u041F\u0440\u0435\u043A\u0440\u0430\u0441\u043D\u043E!
\u0422\u0435\u043A\u0443\u0449\u0438\u0439 \u0441\u0447\u0435\u0442 \u0443\u043A\u0430\u0437\u0430\u043D \u043D\u0438\u0436\u0435.
\u0422\u0435\u043F\u0435\u0440\u044C \u043D\u0430\u0447\u0438\u043D\u0430\u0435\u043C \u043D\u043E\u0432\u044B\u0439 \u0440\u0430\u0443\u043D\u0434...</text>
    </step>

    <step>
			<name>buying</name>
			<conditions>
				<condition type="WindowVisible">
					<window>Buy</window>
					<next>defenses</next>
				</condition>
			</conditions>
			<text>\u0427\u0442\u043E\u0431\u044B \u043E\u0442\u043F\u0440\u0430\u0437\u0434\u043D\u043E\u0432\u0430\u0442\u044C \u0432\u0430\u043C \u0431\u044B\u043B\u0430 \u0434\u0430\u043D\u0430 \u043E\u0433\u0440\u043E\u043C\u043D\u0430\u044F \u0441\u0443\u043C\u043C\u0430 \u0434\u0435\u043D\u0435\u0433.
<a href="buying2">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>		
		</step>	
		
		<step>
			<name>buying2</name>
			<conditions>
				<condition type="WindowVisible">
					<window>Buy</window>
					<next>defenses</next>
				</condition>
			</conditions>
			<text>\u041D\u0438\u0436\u0435 \u0440\u0430\u0441\u043F\u043E\u043B\u0430\u0433\u0430\u0435\u0442\u0441\u044F \u043E\u043A\u043D\u043E \u043F\u043E\u043A\u0443\u043F\u043A\u0438. \u042D\u0442\u043E \u043E\u043A\u043D\u043E \u0434\u043E\u0441\u0442\u0443\u043F\u043D\u043E \u0442\u043E\u043B\u044C\u043A\u043E \u0432 \u043D\u0430\u0447\u0430\u043B\u0435 \u043A\u0430\u0436\u0434\u043E\u0433\u043E \u0440\u0430\u0443\u043D\u0434\u0430, \u0430 \u044D\u0442\u043E \u0437\u043D\u0430\u0447\u0438\u0442, \u0447\u0442\u043E \u043A\u0443\u043F\u0438\u0442\u044C \u0447\u0442\u043E-\u0442\u043E \u043C\u043E\u0436\u043D\u043E \u0442\u043E\u043B\u044C\u043A\u043E \u0432 \u043D\u0430\u0447\u0430\u043B\u0435 \u0440\u0430\u0443\u043D\u0434\u0430.
<a href="buying3">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>		
		</step>		
		
		<step>
			<name>buying3</name>
			<conditions>
				<condition type="WindowVisible">
					<window>Buy</window>
					<next>defenses</next>
				</condition>
			</conditions>
			<text>\u041D\u0430\u0436\u0438\u043C\u0430\u0439\u0442\u0435 \u043D\u0430 \u0437\u0435\u043B\u0435\u043D\u044B\u0435 \u043A\u043D\u043E\u043F\u043A\u0438 \u0434\u043B\u044F \u043F\u043E\u043A\u0443\u043F\u043A\u0438 \u0438 \u043A\u0440\u0430\u0441\u043D\u044B\u0435 \u043A\u043D\u043E\u043F\u043A\u0438 \u0434\u043B\u044F \u043F\u0440\u043E\u0434\u0430\u0436\u0438 \u0438\u043D\u0432\u0435\u043D\u0442\u0430\u0440\u044F.
\u0412\u044B \u0442\u0430\u043A\u0436\u0435 \u043C\u043E\u0436\u0435\u0442\u0435 \u043A\u0443\u043F\u0438\u0442\u044C \u0437\u0430\u0449\u0438\u0442\u0443 \u0434\u043B\u044F \u0441\u0432\u043E\u0435\u0433\u043E \u0442\u0430\u043D\u043A\u0430 \u043F\u0435\u0440\u0435\u043A\u043B\u044E\u0447\u0438\u0432\u0448\u0438\u0441\u044C \u043D\u0430 \u0432\u043A\u043B\u0430\u0434\u043A\u0443 \u0437\u0430\u0449\u0438\u0442\u044B.

\u041F\u043E\u0441\u043B\u0435 \u0442\u043E\u0433\u043E \u043A\u0430\u043A \u0432\u044B \u043A\u0443\u043F\u0438\u043B\u0438 \u0432\u0441\u0451, \u0447\u0442\u043E \u0445\u043E\u0442\u0435\u043B\u0438 \u043D\u0430\u0436\u043C\u0438\u0442\u0435 \u043A\u043D\u043E\u043F\u043A\u0443 <event action="highlight" window="" control="Ok">Ok</event> \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C.</text>
		</step>		
		
		<step>
			<name>defenses</name>
			<text>\u0415\u0441\u043B\u0438 \u0432\u044B \u043F\u0440\u0438\u043E\u0431\u0440\u0435\u043B\u0438 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0432\u0438\u0434\u043E\u0432 \u043E\u0440\u0443\u0436\u0438\u044F, \u0442\u043E \u0432\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u0432\u044B\u0431\u0440\u0430\u0442\u044C \u043F\u043E\u0434\u0445\u043E\u0434\u044F\u0449\u0438\u0439 \u0432 \u0434\u0430\u043D\u043D\u043E\u043C \u0441\u043B\u0443\u0447\u0430\u0435 \u0442\u0438\u043F, \u043D\u0430\u0436\u0430\u0442\u0438\u0435\u043C \u043D\u0430  <event action="highlight" window="Weapon" control="Weapon">\u043F\u0430\u043D\u0435\u043B\u044C \u043E\u0440\u0443\u0436\u0438\u044F</event> \u0438 \u0432\u044B\u0431\u0438\u0440\u0430\u044F \u043D\u0443\u0436\u043D\u043E\u0435 \u043E\u0440\u0443\u0436\u0438\u044F \u0438\u0437 \u043F\u043E\u044F\u0432\u0438\u0432\u0448\u0435\u0433\u043E\u0441\u044F \u0441\u043F\u0438\u0441\u043A\u0430.
<a href="defenses2">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>			

		<step>
			<name>defenses2</name>
			<text>\u0429\u0438\u0442\u044B \u043F\u043E\u0432\u044B\u0448\u0430\u044E\u0442 \u0437\u0430\u0449\u0438\u0442\u0443 \u0432\u0430\u0448\u0435\u0433\u043E \u0442\u0430\u043D\u043A\u0430 \u043E\u0442 \u0430\u0442\u0430\u043A \u043F\u0440\u043E\u0442\u0438\u0432\u043D\u0438\u043A\u043E\u0432. \u0414\u043B\u044F \u043F\u043E\u043B\u043D\u043E\u0444\u0443\u043D\u043A\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u043E\u0439 \u0440\u0430\u0431\u043E\u0442\u044B \u0449\u0438\u0442\u044B \u0434\u043E\u043B\u0436\u043D\u044B \u0431\u044B\u0442\u044C \u0430\u043A\u0442\u0438\u0432\u0438\u0440\u043E\u0432\u0430\u043D\u044B.
\u041A\u043E\u0433\u0434\u0430 \u0449\u0438\u0442\u044B \u0430\u043A\u0442\u0438\u0432\u0438\u0440\u043E\u0432\u0430\u043D\u044B, \u043E\u043D\u0438 \u0437\u0430\u0449\u0438\u0449\u0430\u044E\u0442 \u0432\u0430\u0448 \u0442\u0430\u043D\u043A \u043E\u0442 \u0440\u0430\u0437\u043B\u0438\u0447\u043D\u044B\u0445 \u043F\u043E\u0432\u0440\u0435\u0436\u0434\u0435\u043D\u0438\u0439, \u043D\u0430\u043D\u0435\u0441\u0435\u043D\u043D\u044B\u0445 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u044E\u0449\u0438\u043C \u043E\u0440\u0443\u0436\u0438\u0435\u043C \u0432\u0440\u0430\u0433\u043E\u0432.
\u0427\u0442\u043E\u0431\u044B \u0430\u043A\u0442\u0438\u0432\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0449\u0438\u0442\u044B \u043D\u0430\u0436\u043C\u0438\u0442\u0435 \u043D\u0430  <event action="highlight" window="Player" control="Shield">\u043F\u0430\u043D\u0435\u043B\u044C \u0449\u0438\u0442\u043E\u0432</event> \u0438 \u0432\u044B\u0431\u0435\u0440\u0438\u0442\u0435 \u043D\u0443\u0436\u043D\u044B\u0439 \u0432\u0430\u043C \u0442\u0438\u043F \u0449\u0438\u0442\u0430.
<a href="defenses3">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>			
		
		<step>
			<name>defenses3</name>
			<text>\u0411\u0430\u0442\u0430\u0440\u0435\u0439\u043A\u0438 \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u044E\u0442 \u0432\u043E\u0441\u043F\u043E\u043B\u043D\u0438\u0442\u044C \u043A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u0437\u0434\u043E\u0440\u043E\u0432\u044C\u044F \u0432\u0430\u0448\u0435\u0433\u043E \u0442\u0430\u043D\u043A\u0430 \u0432\u043E \u0432\u0440\u0435\u043C\u044F \u0445\u043E\u0434\u0430. \u0417\u0430\u043F\u043E\u043C\u043D\u0438\u0442\u0435, \u0447\u0442\u043E \u0447\u0435\u043C \u043C\u0435\u043D\u044C\u0448\u0438\u0439 \u0443\u0440\u043E\u0432\u0435\u043D\u044C \u0437\u0434\u043E\u0440\u043E\u0432\u044C\u044F \u0432\u0430\u0448\u0435\u0433\u043E \u0442\u0430\u043D\u043A\u0430 - \u0442\u0435\u043C \u043C\u0435\u043D\u044C\u0448\u0438\u0439 \u0434\u0438\u0430\u043F\u0430\u0437\u043E\u043D \u0441\u0438\u043B\u044B \u0432\u044B\u0441\u0442\u0440\u0435\u043B\u0430 \u0432\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C (\u043D\u0430 \u043C\u0435\u043D\u044C\u0448\u0443\u044E \u0434\u0438\u0441\u0442\u0430\u043D\u0446\u0438\u044E).
\u0415\u0441\u043B\u0438 \u0432\u044B \u043F\u0440\u0438\u043E\u0431\u0440\u0435\u043B\u0438 \u0431\u0430\u0442\u0430\u0440\u0435\u0439\u043A\u0438 \u0438 \u043D\u0443\u0436\u0434\u0430\u0435\u0442\u0435\u0441\u044C \u0443 \u0432\u043E\u0441\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0438 \u0437\u0434\u043E\u0440\u043E\u0432\u044C\u044F \u043D\u0430\u0436\u043C\u0438\u0442\u0435 \u043D\u0430  <event action="highlight" window="Player" control="Battery">\u043F\u0430\u043D\u0435\u043B\u044C \u0431\u0430\u0442\u0430\u0440\u0435\u0435\u043A</event> \u0438 \u0432\u044B\u0431\u0435\u0440\u0438\u0442\u0435 \u043D\u0443\u0436\u043D\u043E\u0435 \u043A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u0431\u0430\u0442\u0430\u0440\u0435\u0435\u043A, \u043A\u043E\u0442\u043E\u0440\u043E\u0435 \u0432\u044B \u0445\u043E\u0442\u0438\u0442\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C. 
<a href="defenses4">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>			

		<step>
			<name>defenses4</name>
			<text>\u041F\u0440\u0438 \u043D\u043E\u0440\u043C\u0430\u043B\u044C\u043D\u044B\u0445 \u0443\u0441\u043B\u043E\u0432\u0438\u044F\u0445 \u043F\u0430\u0440\u0430\u0448\u044E\u0442\u044B \u0437\u0430\u0449\u0438\u0449\u0430\u044E\u0442 \u0432\u0430\u0448 \u0442\u0430\u043D\u043A \u043E\u0442 \u043F\u043E\u0432\u0440\u0435\u0436\u0434\u0435\u043D\u0438\u0439 \u043F\u0440\u0438 \u043F\u0430\u0434\u0435\u043D\u0438\u0438.
\u0410\u043A\u0442\u0438\u0432\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u0435 \u043F\u0430\u0440\u0430\u0448\u044E\u0442\u044B \u0431\u0443\u0434\u0443\u0442 \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438 \u0440\u0430\u0441\u043A\u0440\u044B\u0432\u0430\u0442\u044C\u0441\u044F \u043F\u0440\u0438 \u043A\u0430\u0436\u0434\u043E\u043C \u043F\u0430\u0434\u0435\u043D\u0438\u0438 \u0442\u0430\u043D\u043A\u0430. \u0415\u0441\u043B\u0438 \u0432\u044B \u043F\u0440\u0438\u043E\u0431\u0440\u0435\u043B\u0438 \u043F\u0430\u0440\u0430\u0448\u044E\u0442\u044B \u0438 \u0445\u043E\u0442\u0438\u0442\u0435 \u0438\u0445 \u0430\u043A\u0442\u0438\u0432\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u043D\u0430\u0436\u043C\u0438\u0442\u0435 \u043D\u0430 <event action="highlight" window="Player" control="Parachute">\u043F\u0430\u043D\u0435\u043B\u044C \u043F\u0430\u0440\u0430\u0448\u044E\u0442\u043E\u0432</event> \u0438 \u0432\u043A\u043B\u044E\u0447\u0438\u0442\u0435 \u0438\u0445.
<a href="defenses5">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>	

		<step>
			<name>defenses5</name>
			<text>\u041A\u0440\u043E\u043C\u0435 \u0441\u0442\u0440\u0435\u043B\u044C\u0431\u044B \u0442\u0430\u043D\u043A\u0438 \u0442\u0430\u043A\u0436\u0435 \u0443\u043C\u0435\u044E\u0442 \u0435\u0437\u0434\u0438\u0442\u044C \u043F\u043E \u043F\u043E\u0432\u0435\u0440\u0445\u043D\u043E\u0441\u0442\u0438. \u0427\u0442\u043E\u0431\u044B \u043F\u0435\u0440\u0435\u0434\u0432\u0438\u0433\u0430\u0442\u044C\u0441\u044F, \u0442\u0430\u043D\u043A\u0443 \u043D\u0443\u0436\u043D\u043E \u0442\u043E\u043F\u043B\u0438\u0432\u043E. \u0427\u0435\u043C \u0431\u043E\u043B\u044C\u0448\u0435\u0435 \u043A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u0442\u043E\u043F\u043B\u0438\u0432\u0430 \u0435\u0441\u0442\u044C \u0432 \u043D\u0430\u043B\u0438\u0447\u0438\u0438, \u0442\u0435\u043C \u0434\u043E\u043B\u044C\u0448\u0435 \u0441\u043C\u043E\u0436\u0435\u0442 \u0443\u0435\u0445\u0430\u0442\u044C \u0442\u0430\u043D\u043A.
\u0415\u0441\u043B\u0438 \u0432\u044B \u043F\u0440\u0438\u043E\u0431\u0440\u0435\u043B\u0438 \u0442\u043E\u043F\u043B\u0438\u0432\u043E \u0438 \u0445\u043E\u0442\u0438\u0442\u0435 "\u043A\u0443\u0434\u0430-\u0442\u043E \u0443\u0435\u0445\u0430\u0442\u044C" \u043D\u0430\u0436\u043C\u0438\u0442\u0435 \u043D\u0430 <event action="highlight" window="Player" control="Fuel">\u043F\u0430\u043D\u0435\u043B\u044C \u0442\u043E\u043F\u043B\u0438\u0432\u0430</event> \u0438 \u0432\u044B\u0431\u0435\u0440\u0438\u0442\u0435 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u044E\u0449\u0438\u0439 \u0432\u0438\u0434 \u0442\u043E\u043F\u043B\u0438\u0432\u0430. \u0417\u0430\u0442\u0435\u043C \u043D\u0430\u0436\u043C\u0438\u0442\u0435 \u043D\u0430 \u043D\u0443\u0436\u043D\u0443\u044E \u043F\u043E\u0432\u0435\u0440\u0445\u043D\u043E\u0441\u0442\u044C \u043D\u0430 \u043B\u0430\u043D\u0434\u0448\u0430\u0444\u0442\u0435 (\u0432 \u043F\u0440\u0435\u0434\u0435\u043B\u0430\u0445 \u0437\u043E\u043D\u044B) \u043A\u0443\u0434\u0430 \u0445\u043E\u0442\u0438\u0442\u0435 \u043F\u0435\u0440\u0435\u043C\u0435\u0441\u0442\u0438\u0442\u044C \u0442\u0430\u043D\u043A. \u0422\u0430\u043D\u043A \u043C\u043E\u0436\u0435\u0442 \u043F\u0435\u0440\u0435\u0434\u0432\u0438\u0433\u0430\u0442\u044C\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u043D\u0430 \u0431\u043E\u043B\u0435\u0435 \u043D\u0438\u0437\u043A\u0438\u0435 \u0443\u0447\u0430\u0441\u0442\u043A\u0438 \u043B\u0430\u043D\u0434\u0448\u0430\u0444\u0442\u0430 \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0435\u043B\u044C\u043D\u043E \u0435\u0433\u043E \u043F\u0435\u0440\u0432\u043E\u043D\u0430\u0447\u0430\u043B\u044C\u043D\u043E\u0433\u043E \u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u044F.
<a href="end">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>	
		
		<step>
			<name>end</name>
			<text>\u042D\u0442\u043E \u043A\u043E\u043D\u0435\u0446 \u0434\u0430\u043D\u043D\u043E\u0433\u043E \u043A\u0443\u0440\u0441\u0430 \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u044F! \u0412\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u0438\u0433\u0440\u0430\u0442\u044C, \u0438\u043B\u0438 \u0436\u0435 \u043F\u043E\u043A\u0438\u043D\u0443\u0442\u044C \u043C\u0430\u0442\u0447, \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u044F <event action="menu" menu="Player">\u0433\u043B\u0430\u0432\u043D\u043E\u0435 \u043C\u0435\u043D\u044E</event>.
<a href="exit">\u041D\u0430\u0436\u043C\u0438\u0442\u0435 \u0441\u044E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u0442\u044C \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u0435 ...</a></text>
		</step>		
	</steps>
</tutorial>